{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "n/a",
    "1": "arts and culture",
    "2": "digital",
    "3": "education",
    "4": "climate change",
    "5": "studying abroad",
    "6": "renewable energy",
    "7": "policy dialogues",
    "8": "youth and the world",
    "9": "environmental sustainability",
    "10": "health and well-being",
    "11": "sports",
    "12": "inclusion",
    "13": "employment",
    "14": "european learning mobility",
    "15": "research and innovation",
    "16": "democratic values"
  },
  "initializer_range": 0.02,
  "label2id": {
    "arts and culture": 1,
    "climate change": 4,
    "democratic values": 16,
    "digital": 2,
    "education": 3,
    "employment": 13,
    "environmental sustainability": 9,
    "european learning mobility": 14,
    "health and well-being": 10,
    "inclusion": 12,
    "n/a": 0,
    "policy dialogues": 7,
    "renewable energy": 6,
    "research and innovation": 15,
    "sports": 11,
    "studying abroad": 5,
    "youth and the world": 8
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.17.0",
  "vocab_size": 30522
}
